#Checking interfaces

== Enter privileged exec mode (conf t)

#SHOWING INTERFACES
-- show ip int brief
OR
-- show interface status
OR 
-- show ip interface brief


#Shutting down interfaces

SW1 > en
SW1# conf t
SW1(config)# int f0/1
SW1(config-if)# shutdown
SW1(config-if)# end
SW1# write

#Shutting down a range oof interfaces

SW1 > en
SW1# conf t
SW1(config)# int range f0/1 - 21, g0/0 - 2
SW1(config-if-range)# shutdown
SW1(config-if)# end
SW1# write               #write changes to start-up configs

#Changing SPEED and DUPLEX nature of interface

SW1 > en
SW1# conf t
SW1(config)# int f0/1
SW1(config-if)# speed 100           #You can only choose between 10, 100, and AUTO ONLY
SW1(config-if)# duplex full         #You can choose between FULL, HALF, and AUTO duplex ONLY
SW1(config-if)# description ## Some descriptive statement ## 
SW1(config-if)# end
SW1# write               #write changes to start-up configs

#CREATING VLANS

SW1 > en
SW# vlan 10
SW(config)# name management
SW(config)# end
SW1# conf t
SW1(config)# int f0/1
SW1(config-if)# switchport access vlan 10
SW1(config-if)# no shut

#Making Trunk Ports

SW1 > en
SW1# conf t
SW1(config)# int g0/1
SW1(config-if)# switchport mode trunk 
SW1(config-if)# no shut

#Checking switch configs

-- show interface description

#Checking running config on interface
-- show running-config int gi0/1/1

#Adding a vlan to an existing POOL
-- conf t
-- int gi0/1/1
-- switchport trunk allowed vlan add 100 #Make sure to use ADD  or else delete other vlans





